CREATE DATABASE  IF NOT EXISTS `carrental` /*!40100 DEFAULT CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci */ /*!80016 DEFAULT ENCRYPTION='N' */;
USE `carrental`;
-- MySQL dump 10.13  Distrib 8.0.43, for Win64 (x86_64)
--
-- Host: localhost    Database: carrental
-- ------------------------------------------------------
-- Server version	8.0.43

/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!50503 SET NAMES utf8 */;
/*!40103 SET @OLD_TIME_ZONE=@@TIME_ZONE */;
/*!40103 SET TIME_ZONE='+00:00' */;
/*!40014 SET @OLD_UNIQUE_CHECKS=@@UNIQUE_CHECKS, UNIQUE_CHECKS=0 */;
/*!40014 SET @OLD_FOREIGN_KEY_CHECKS=@@FOREIGN_KEY_CHECKS, FOREIGN_KEY_CHECKS=0 */;
/*!40101 SET @OLD_SQL_MODE=@@SQL_MODE, SQL_MODE='NO_AUTO_VALUE_ON_ZERO' */;
/*!40111 SET @OLD_SQL_NOTES=@@SQL_NOTES, SQL_NOTES=0 */;

--
-- Table structure for table `orders`
--

DROP TABLE IF EXISTS `orders`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!50503 SET character_set_client = utf8mb4 */;
CREATE TABLE `orders` (
  `id` int NOT NULL AUTO_INCREMENT,
  `order_no` varchar(255) DEFAULT NULL,
  `pickup_location` varchar(255) DEFAULT NULL,
  `return_location` varchar(255) DEFAULT NULL,
  `pickup_date` varchar(255) DEFAULT NULL,
  `return_date` varchar(255) DEFAULT NULL,
  `pickup_time` varchar(255) DEFAULT NULL,
  `return_time` varchar(255) DEFAULT NULL,
  `car_id` int NOT NULL,
  `car_name` varchar(255) DEFAULT NULL,
  `car_price` int NOT NULL,
  `rental_days` int NOT NULL,
  `insurance` tinyint(1) NOT NULL,
  `child_seat_qty` int NOT NULL,
  `total_amount` int NOT NULL,
  `status` varchar(255) DEFAULT NULL,
  `created_at` varchar(255) DEFAULT NULL,
  `member_no` varchar(255) DEFAULT NULL,
  PRIMARY KEY (`id`)
) ENGINE=InnoDB AUTO_INCREMENT=30 DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_0900_ai_ci;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `orders`
--

LOCK TABLES `orders` WRITE;
/*!40000 ALTER TABLE `orders` DISABLE KEYS */;
INSERT INTO `orders` VALUES (1,'OD1763628227433','松山店','南港車站店','2025-11-26','2025-11-29','04:30','03:30',1,'Toyota Yaris 經濟款',1500,3,1,0,5700,'已取消','2025-11-20 16:43:47',NULL),(2,'OD1763628236124','松山店','南港車站店','2025-11-26','2025-11-29','04:30','03:30',1,'Toyota Yaris 經濟款',1500,3,1,0,5700,'預約中','2025-11-20 16:43:56',NULL),(3,'OD1763628240189','松山店','南港車站店','2025-11-26','2025-11-29','04:30','03:30',1,'Toyota Yaris 經濟款',1500,3,1,0,5700,'預約中','2025-11-20 16:44:00',NULL),(4,'OD1763628514876','松山店','南港車站店','2025-11-26','2025-11-29','04:30','03:30',1,'Toyota Yaris 經濟款',1500,1,0,0,1500,'預約中','2025-11-20 16:48:35',NULL),(5,'OD1763628619700','松山店','南港車站店','2025-11-26','2025-11-29','04:30','03:30',1,'Toyota Yaris 經濟款',1500,1,0,0,1500,'預約中','2025-11-20 16:50:20',NULL),(6,'OD1763628676036','松山店','南港車站店','2025-11-26','2025-11-29','04:30','03:30',1,'Toyota Yaris 經濟款',1500,8,1,7,14600,'預約中','2025-11-20 16:51:16',NULL),(7,'OD1763628938979','松山店','南港車站店','2025-11-26','2025-11-29','04:30','03:30',1,'Toyota Yaris 經濟款',1500,8,1,2,13600,'預約中','2025-11-20 16:55:39',NULL),(8,'OD1763629104611','台北車站店','台北車站店','2025-11-26','2025-11-29','00:00','00:00',1,'Toyota Yaris 經濟款',1500,7,0,3,11100,'預約中','2025-11-20 16:58:25','m00005'),(9,'OD1763629936417','台北車站店','台北車站店','2025-11-26','2025-11-29','00:00','00:00',1,'Toyota Yaris 經濟款',1500,8,1,2,13600,'預約中','2025-11-20 17:12:16','m00006'),(10,'OD1763629963370','台北車站店','台北車站店','2025-11-26','2025-11-29','00:00','00:00',1,'Toyota Yaris 經濟款',1500,8,1,2,13600,'預約中','2025-11-20 17:12:43','m00010'),(11,'OD1763630022073','台北車站店','台北車站店','2025-11-26','2025-11-29','00:00','00:00',1,'Toyota Yaris 經濟款',1500,8,1,2,13600,'預約中','2025-11-20 17:13:42','m00001'),(12,'OD1763630403372','台北車站店','台北車站店','2025-11-26','2025-11-29','00:00','00:00',1,'Toyota Yaris 經濟款',1500,8,1,2,13600,'預約中','2025-11-20 17:20:03','m00003'),(13,'OD1763630406138','台北車站店','台北車站店','2025-11-26','2025-11-29','00:00','00:00',1,'Toyota Yaris 經濟款',1500,8,1,2,13600,'預約中','2025-11-20 17:20:06','m00008'),(14,'OD1763630518385','台北車站店','台北車站店','2025-11-26','2025-11-29','00:00','00:00',1,'Toyota Yaris 經濟款',1500,8,1,2,13600,'預約中','2025-11-20 17:21:58','m00007'),(15,'OD1763630526458','台北車站店','台北車站店','2025-11-26','2025-11-29','00:00','00:00',1,'Toyota Yaris 經濟款',1500,1,0,0,1500,'預約中','2025-11-20 17:22:06','m00005'),(16,'OD1763630565164','台北車站店','台北車站店','2025-11-21','2025-11-20','00:00','00:00',1,'Toyota Yaris 經濟款',1500,1,0,0,1500,'預約中','2025-11-20 17:22:45','m00002'),(17,'OD1763630587368','台北車站店','台北車站店','2025-11-21','2025-11-29','00:00','00:00',1,'Toyota Yaris 經濟款',1500,8,1,2,13600,'預約中','2025-11-20 17:23:07','m00004'),(18,'OD1763630630937','台北車站店','台北車站店','2025-11-21','2025-11-29','00:00','00:00',1,'Toyota Yaris 經濟款',1500,8,0,0,12000,'預約中','2025-11-20 17:23:51','m00001'),(19,'OD1763640644687','台北車站店','台北車站店','2025-11-21','2025-11-28','00:00','00:00',2,'Toyota Altis 旗艦款',1700,7,0,0,11900,'預約中','2025-11-20 20:10:45','m00008'),(20,'OD1763641475673','台北車站店','台北車站店','2025-11-21','2025-11-28','00:00','00:00',2,'Toyota Altis 旗艦款',1700,7,1,3,13700,'預約中','2025-11-20 20:24:36','m00006'),(21,'OD1763641627633','松山機場店','南港車站店','2025-11-21','2025-11-28','01:00','02:00',1,'Toyota Yaris 經濟款',1500,7,1,3,12300,'預約中','2025-11-20 20:27:08','m00009'),(22,'OD1763643002253','台北車站店','台北車站店','2025-11-21','2025-11-28','00:00','00:00',1,'Toyota Yaris 經濟款',1500,7,1,2,12100,'預約中','2025-11-20 20:50:02','m00007'),(23,'OD1763649057021','台北車站店','台北機場店','2025-11-21','2025-11-22','00:30','03:30',1,'Toyota Yaris 經濟款',1500,1,1,1,2900,'預約中','2025-11-20 22:30:57','m00001'),(24,'OD1763711902011','台中火車站店','新竹高鐵店','2025-11-25','2025-11-28','09:00','08:00',3,'Toyota RAV4 休旅車',1800,3,0,1,5600,'預約中','2025-11-21T15:58:22.011705800','m00003'),(25,'OD1763714363768','桃園機場店','新竹高鐵店','2025-11-26','2025-11-29','03:00','01:30',2,'Toyota Altis 旗艦款',1700,3,1,0,6300,'預約中','2025-11-21T16:39:23.768122100','m00007'),(26,'OD1764055310754','台北車站店','新竹高鐵店','2025-11-28','2025-11-29','03:00','09:00',3,'Toyota RAV4 休旅車',1800,1,1,1,3200,'預約中','2025-11-25T15:21:50.753646200','m00010'),(27,'OD1764055681082','桃園機場店','桃園機場店','2025-11-27','2025-12-01','01:30','10:00',2,'Toyota Altis 旗艦款',1700,4,1,1,8200,'已取消','2025-11-25T15:28:01.082062300','m00010'),(28,'OD1764056973033','桃園機場店','新竹高鐵店','2025-11-29','2025-12-28','02:00','02:00',2,'Toyota Altis 旗艦款',1700,29,1,1,50700,'預約中','2025-11-25T15:49:33.033398300','m00010'),(29,'OD1764059153142','台中高鐵店','桃園機場店','2025-11-27','2025-11-28','01:30','03:00',2,'Toyota Altis 旗艦款',1700,1,1,1,3100,'已取消','2025-11-25T16:25:53.142839100','m00010');
/*!40000 ALTER TABLE `orders` ENABLE KEYS */;
UNLOCK TABLES;
/*!40103 SET TIME_ZONE=@OLD_TIME_ZONE */;

/*!40101 SET SQL_MODE=@OLD_SQL_MODE */;
/*!40014 SET FOREIGN_KEY_CHECKS=@OLD_FOREIGN_KEY_CHECKS */;
/*!40014 SET UNIQUE_CHECKS=@OLD_UNIQUE_CHECKS */;
/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
/*!40111 SET SQL_NOTES=@OLD_SQL_NOTES */;

-- Dump completed on 2025-11-26 13:13:39
